/* Top Level Items */
"MENU_APP" = "@{APP_TITLE}";
"MENU_EDIT" = "Edit";
"MENU_WINDOW" = "Window";
"MENU_HELP" = "Help";

/* App Menu Items */
"MENU_APP_ABOUT" = "About @{APP_TITLE}";
"MENU_APP_SCREENSHOT" = "Screenshot";
"MENU_APP_HIDE" = "Hide @{APP_TITLE}";
"MENU_APP_HIDE_OTHERS" = "Hide Others";
"MENU_APP_SHOW_ALL" = "Show All";
"MENU_APP_QUIT" = "Quit @{APP_TITLE}";
"MENU_APP_REVEAL" = "Show in Finder";
"MENU_APP_REVEAL_GAME_PREFERENCES" = "Game Preferences";
"MENU_APP_REVEAL_GAME_SCREENSHOTS" = "Game Screenshots";
"MENU_APP_REVEAL_GAME_LOGS" = "Game Logs";
"MENU_APP_REVEAL_APPLICATION_SUPPORT" = "Application Support";
"MENU_APP_REVEAL_BATTLENET" = "Battle.net";
"MENU_APP_REVEAL_APPLICATION_PREFERENCES" = "Application Preferences";
"MENU_APP_REVEAL_APPLICATION" = "Application";

/* Edit Menu Items */
"MENU_EDIT_UNDO" = "Undo";
"MENU_EDIT_CUT" = "Cut";
"MENU_EDIT_COPY" = "Copy";
"MENU_EDIT_PASTE" = "Paste";
"MENU_EDIT_DELETE" = "Delete";
"MENU_EDIT_SELECT_ALL" = "Select All";
"MENU_EDIT_FIND" = "Find";
"MENU_EDIT_FIND_FIND" = "Find…";
"MENU_EDIT_FIND_NEXT" = "Find Next";
"MENU_EDIT_FIND_PREVIOUS" = "Find Previous";
"MENU_EDIT_FIND_USE_SELECTION" = "Use Selection for Find";
"MENU_EDIT_FIND_JUMP_TO_SELECTION" = "Jump to Selection";
"MENU_EDIT_SPECIAL_CHARS" = "Special Characters…";

/* Window Menu Items */
"MENU_WINDOW_CLOSE" = "Close";
"MENU_WINDOW_MINIMIZE" = "Minimize";
"MENU_WINDOW_ZOOM" = "Zoom";
"MENU_WINDOW_FULLSCREEN" = "Toggle Full Screen";
"MENU_WINDOW_BRING_ALL_TO_FRONT" = "Bring All to Front";

/* Help Menu Items */
"MENU_HELP_GAME_HOMEPAGE" = "@{APP_TITLE}";
"MENU_HELP_TECHNICAL_SUPPORT_FORUM" = "Technical Support Forum";
"MENU_HELP_SUPPORT_PORTAL" = "Support Portal";
"MENU_HELP_COPY_SUPPORT_INFO" = "Copy Support Information";

/* Use when the application loads and it checks OS version */
"VERSION_CHECK" = "You are running @{OS_VERSION}. An update to the operating system is available which will increase stability within @{APP_TITLE}. For the best results in @{APP_TITLE}, please use Software Update to upgrade to the latest version.";
"VERSION_UNSUPPORTED" = "This is a reminder that @{OS_VERSION} has entered the end of life stage as an operating system for @{APP_TITLE}. The game will continue to run for a limited time, however we encourage you to upgrade your operating system to @{LATEST_OS_VERSION} as soon as possible. Please refer to the system requirements @{SYSTEM_REQUIREMENTS_URL}. For more information on how to upgrade your operating system, please see this @{OS_UPGRADE_URL}. For further explanation of our Macintosh operating system guidelines, please see this @{OS_GUIDELINES_URL}.";
"OS_UPGRADE_URL" = "https://battle.net/support/article/4100043";
"OS_GUIDELINES_URL" = "https://battle.net/support/article/7400087";
"VERSION_UNSUPPORTED_TITLE" = "@{OS_VERSION} Not Supported";
"CONTINUE_ANYWAY" = "Continue Anyway";
"LAUNCH_SOFTWARE_UPDATE" = "Launch Software Update";
"INVALID_VIDEO_DEVICE" = "@{APP_TITLE} cannot start because a valid graphics processor cannot be found.";
"ERROR" = "Error";
